app/controllers/domicilios_controller.rb

SELECT "domicilios".* FROM "domicilios"
---
  def index
    @domicilios = Domicilio.all