app/controllers/matriculas_controller.rb

  def index
    @matriculas = Matricula.all
---
SELECT "matriculas".* FROM "matriculas"

  def show
    @matricula = Matricula.find(params[:id])
---
SELECT "matriculas".* FROM "matriculas" WHERE "matriculas"."id" = ? LIMIT 1  [["id", "1"]]